# CreateDefaultEndTreatmentType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EndTreatmentType..::..CreateDefaultEndTreatmentType Method
EndTreatmentType Class See Also
---
Creates a new EndTreatmentType object with a default name.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static ElementId CreateDefaultEndTreatmentType(
	Document ADoc
)
```

Visual Basic
---
```text
Public Shared Function CreateDefaultEndTreatmentType ( _
	ADoc As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ CreateDefaultEndTreatmentType(
	Document^ ADoc
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The newly created type id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace